doc/spotless-intro.org

* Spotless

A python program for removing cosmic rays, stitching artifacts, and (optionally) stars from an astronomical image or spectrum

The cosmic ray removal process has three stages:

1. Pixel rejection and grouping contiguous bad pixel regions into "objects"
2. Pruning the list of objects in order to minimise false positives
3. "Zapping" all the pixels in each object in the final list by replacing bad pixels by the average of the "good" neighbors

** Compatibility and dependencies
Spotless has been tested on Python 2.7, 3.3, and 3.4. 

It depends on the following third-party libraries:
+ [[http://www.numpy.org][Numpy]] and [[http://www.scipy.org/install.html][Scipy]]
  + If you are using a full-featured scientific python distribution such as [[http://continuum.io/downloads.html][Anaconda]] then you already have these.
+ [[http://scikit-image.org][Scikits Image]]
  + =conda install scikits-image=
+ Either [[http://www.astropy.org][Astropy]] (recommended) or PyFITS (no longer maintained)
  + =conda install astropy=
+ [[https://pypi.python.org/pypi/pyregion][Pyregion]]
  + =pip install pyregion=
  + At time of writing (27 Nov 2014) this is not available in the Anaconda repository, but it can be installed from the Python Package Index using =pip= or =easy_install=

** Installation
Spotless consists of a single executable python script =spotless=.   You can copy to somewhere on your =PATH= (or your working directory), or just leave it where it is, in which case you will have to specify the full path every time you run it.

** Usage
Basic usage: 
#+BEGIN_EXAMPLE
spotless INPUT_FILE
#+END_EXAMPLE
where =INPUT_FILE= is the name (without the =.fits= suffix) of the FITS file that you want to process.  An output file named =INPUT_FILE-cr.fits= will be produced.  

*** File handling
By default, spotless will process the HDU named =SCI= in the input
file if it is found, otherwise the first HDU will be used.  A
different HDU may be specified by using the =--hdu-name= option.

The extra string that is added to the name of the output file (default: =cr=) may be changed using the =--output-id= option.
*** Specifying the pixel-rejection method to use
Three different methods are available for choosing which pixels to reject.  In all cases, the result is a list of candidate "bad pixel objects", each of which is a contiguous region of pixels that are deemed to be bad.  This list is then pruned according to additional criteria discussed below to give a final list of bad pixel objects. 
**** Simple threshold
This method simply rejects all pixels with values greater than a certain value.  
To use /only/ this method, specify the options =--method thresh --threshold VALUE= where =VALUE= is the value of the threshold.   The option =--threshold VALUE= can also be used at the same time as another method, in which case the two methods are combined. 
**** Edge detection followed by hole filling
This is currently the default method so no option is required, but it can also be explicitly selected with =--method edge==.  The option =--data-range MIN MAX= should be used to specify the approximate minimum and maximum values of the image brightness.  There is also an option =--use-log-scale=, which sometimes improves the results for images with a large dynamic range.  
**** Segmentation via watershed transform of the elevation map
This method does not seem to work very well, and so is not recommended.  If you want to try it anyway, the option =--method segment= should be specified. 
