doc/spotless-intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>spotless-intro</title>
<!-- 2014-12-02 Tue 09:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="William Henney" />
</head>
<body>
<div id="content">
<h1 class="title">spotless-intro</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Spotless</a>
<ul>
<li><a href="#sec-1-1">1.1. Compatibility and dependencies</a></li>
<li><a href="#sec-1-2">1.2. Installation</a></li>
<li><a href="#sec-1-3">1.3. Usage</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. File handling</a></li>
<li><a href="#sec-1-3-2">1.3.2. Specifying the pixel-rejection method to use</a></li>
<li><a href="#sec-1-3-3">1.3.3. Pruning the list of bad pixel objects</a></li>
<li><a href="#sec-1-3-4">1.3.4. Manually excluding and including regions</a></li>
<li><a href="#sec-1-3-5">1.3.5. Which images are saved</a></li>
<li><a href="#sec-1-3-6">1.3.6. Examples</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Command line reference</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Spotless</h2>
<div class="outline-text-2" id="text-1">
<p>
A python program for removing cosmic rays, stitching artifacts, and (optionally) stars from an astronomical image or spectrum
</p>

<p>
The cosmic ray removal process has three stages:
</p>

<ol class="org-ol">
<li>Pixel rejection and grouping contiguous bad pixel regions into "objects"
</li>
<li>Pruning the list of objects in order to minimise false positives
</li>
<li>"Zapping" all the pixels in each object in the final list by replacing bad pixels by the average of the "good" neighbors
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Compatibility and dependencies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Spotless has been tested on Python 2.7, 3.3, and 3.4. 
</p>

<p>
It depends on the following third-party libraries:
</p>
<ul class="org-ul">
<li><a href="http://www.numpy.org">Numpy</a> and <a href="http://www.scipy.org/install.html">Scipy</a>
<ul class="org-ul">
<li>If you are using a full-featured scientific python distribution such as <a href="http://continuum.io/downloads.html">Anaconda</a> then you already have these.
</li>
</ul>
</li>
<li><a href="http://scikit-image.org">Scikits Image</a>
<ul class="org-ul">
<li><code>conda install scikits-image</code>
</li>
</ul>
</li>
<li>Either <a href="http://www.astropy.org">Astropy</a> (recommended) or PyFITS (no longer maintained)
<ul class="org-ul">
<li><code>conda install astropy</code>
</li>
</ul>
</li>
<li><a href="https://pypi.python.org/pypi/pyregion">Pyregion</a>
<ul class="org-ul">
<li><code>pip install pyregion</code>
</li>
<li>At time of writing (27 Nov 2014) this is not available in the Anaconda repository, but it can be installed from the Python Package Index using <code>pip</code> or <code>easy_install</code>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Spotless consists of a single executable python script <code>spotless</code>.   You can copy to somewhere on your <code>PATH</code> (or your working directory), or just leave it where it is, in which case you will have to specify the full path every time you run it.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Usage</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Basic usage: 
</p>
<pre class="example">
spotless INPUT_FILE
</pre>
<p>
where <code>INPUT_FILE</code> is the name (without the <code>.fits</code> suffix) of the FITS file that you want to process.  An output file named <code>INPUT_FILE-cr.fits</code> will be produced.  
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> File handling</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
By default, spotless will process the HDU named <code>SCI</code> in the input
file if it is found, otherwise the first HDU will be used.  A
different HDU may be specified by using the <code>--hdu-name</code> option.
</p>

<p>
The extra string that is added to the name of the output file (default: <code>cr</code>) may be changed using the <code>--output-id</code> option.
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Specifying the pixel-rejection method to use</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Three different methods are available for choosing which pixels to reject.  In all cases, the result is a list of candidate "bad pixel objects", each of which is a contiguous region of pixels that are deemed to be bad.  This list is then pruned according to additional criteria discussed below to give a final list of bad pixel objects. 
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-3-2-1" name="sec-1-3-2-1"></a>Simple threshold<br  /><div class="outline-text-5" id="text-1-3-2-1">
<p>
This method simply rejects all pixels with values greater than a certain value.  
To use <i>only</i> this method, specify the options <code>--method thresh --threshold VALUE</code> where <code>VALUE</code> is the value of the threshold.   The option <code>--threshold VALUE</code> can also be used at the same time as another method, in which case the two methods are combined. 
</p>
</div>
</li>
<li><a id="sec-1-3-2-2" name="sec-1-3-2-2"></a>Edge detection followed by hole filling<br  /><div class="outline-text-5" id="text-1-3-2-2">
<p>
This is currently the default method so no option is required, but it can also be explicitly selected with <code>--method edge=</code>.  The option <code>--data-range MIN MAX</code> should be used to specify the approximate minimum and maximum values of the image brightness.  There is also an option <code>--use-log-scale</code>, which sometimes improves the results for images with a large dynamic range.  
</p>
</div>
</li>
<li><a id="sec-1-3-2-3" name="sec-1-3-2-3"></a>Segmentation via watershed transform of the elevation map<br  /><div class="outline-text-5" id="text-1-3-2-3">
<p>
This method does not seem to work very well, and so is not recommended.  If you want to try it anyway, the option <code>--method segment</code> should be specified. 
</p>
</div>
</li></ol>
</div>
