doc/spotless-intro.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Spotless</a>
<ul>
<li><a href="#sec-1-1">1.1. Compatibility and dependencies</a></li>
<li><a href="#sec-1-2">1.2. Installation</a></li>
<li><a href="#sec-1-3">1.3. Usage</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. File handling</a></li>
<li><a href="#sec-1-3-2">1.3.2. Specifying the pixel-rejection method to use</a></li>
<li><a href="#sec-1-3-3">1.3.3. Pruning the list of bad pixel objects</a></li>
<li><a href="#sec-1-3-4">1.3.4. Manually excluding and including regions</a></li>
<li><a href="#sec-1-3-5">1.3.5. Which images are saved</a></li>
<li><a href="#sec-1-3-6">1.3.6. Examples</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Command line reference</a></li>
</ul>
</li>
</ul>
</div>
</div>

# Spotless<a id="sec-1" name="sec-1"></a>

A python program for removing cosmic rays, stitching artifacts, and (optionally) stars from an astronomical image or spectrum

The cosmic ray removal process has three stages:

1.  Pixel rejection and grouping contiguous bad pixel regions into "objects"
2.  Pruning the list of objects in order to minimise false positives
3.  "Zapping" all the pixels in each object in the final list by replacing bad pixels by the average of the "good" neighbors

## Compatibility and dependencies<a id="sec-1-1" name="sec-1-1"></a>

Spotless has been tested on Python 2.7, 3.3, and 3.4. 

It depends on the following third-party libraries:

-   [Numpy](http://www.numpy.org) and [Scipy](http://www.scipy.org/install.html)
    -   If you are using a full-featured scientific python distribution such as [Anaconda](http://continuum.io/downloads.html) then you already have these.
-   [Scikits Image](http://scikit-image.org)
    -   `conda install scikits-image`
-   Either [Astropy](http://www.astropy.org) (recommended) or PyFITS (no longer maintained)
    -   `conda install astropy`
-   [Pyregion](https://pypi.python.org/pypi/pyregion)
    -   `pip install pyregion`
    -   At time of writing (27 Nov 2014) this is not available in the Anaconda repository, but it can be installed from the Python Package Index using `pip` or `easy_install`

## Installation<a id="sec-1-2" name="sec-1-2"></a>

Spotless consists of a single executable python script `spotless`.   You can copy to somewhere on your `PATH` (or your working directory), or just leave it where it is, in which case you will have to specify the full path every time you run it.

## Usage<a id="sec-1-3" name="sec-1-3"></a>

Basic usage: 

    spotless INPUT_FILE

where `INPUT_FILE` is the name (without the `.fits` suffix) of the FITS file that you want to process.  An output file named `INPUT_FILE-cr.fits` will be produced.  

### File handling<a id="sec-1-3-1" name="sec-1-3-1"></a>

By default, spotless will process the HDU named `SCI` in the input
file if it is found, otherwise the first HDU will be used.  A
different HDU may be specified by using the `--hdu-name` option.

The extra string that is added to the name of the output file (default: `cr`) may be changed using the `--output-id` option.

### Specifying the pixel-rejection method to use<a id="sec-1-3-2" name="sec-1-3-2"></a>

Three different methods are available for choosing which pixels to reject.  In all cases, the result is a list of candidate "bad pixel objects", each of which is a contiguous region of pixels that are deemed to be bad.  This list is then pruned according to additional criteria discussed below to give a final list of bad pixel objects. 

1.  Simple threshold

    This method simply rejects all pixels with values greater than a certain value.  
    To use *only* this method, specify the options `--method thresh --threshold VALUE` where `VALUE` is the value of the threshold.   The option `--threshold VALUE` can also be used at the same time as another method, in which case the two methods are combined. 

2.  Edge detection followed by hole filling

    This is currently the default method so no option is required, but it can also be explicitly selected with `--method edge=`.  The option `--data-range MIN MAX` should be used to specify the approximate minimum and maximum values of the image brightness.  There is also an option `--use-log-scale`, which sometimes improves the results for images with a large dynamic range.  

3.  Segmentation via watershed transform of the elevation map

    This method does not seem to work very well, and so is not recommended.  If you want to try it anyway, the option `--method segment` should be specified. 
