doc/spotless-intro.org
*** Pruning the list of bad pixel objects
The pixel-rejection methods all tend to produce a large number of false positives.  Many of these can be effectively pruned with a few simple criteria.  Each candidate object is checked to make sure it is sufficiently small, sufficiently circular, and not a dark region.  The details of these checks can be controlled with the options =--dmax=, =--ddmax=, =--reject-filaments=, and =--allow-shadows=.  See the [[id:38945ACB-CA8C-4C73-9898-2EA1BF8272D1][Command line reference]] below for details. 


*** Manually excluding and including regions
The option =--exclude-regions-from-file FILENAME.reg= allows you to specify a DS9 region file for exclusion from the algorithm.  All regions in this file will be marked as "good".  That is, no cosmic ray detection will be performed inside the regions.  It is often necessary to use this option to protect known stars in your image (unless you want the stars to be zapped). 

Contrariwise, the option =--include-regions-from-file FILENAME.reg= allows you to specify known "bad" regions.  All regions in this file will be automatically added to the final list of bad pixel objects to be zapped.  

*** Which images are saved
By default, the =SCI= HDU in the output file has had all its final bad pixels zapped (but if the option =--only-bad-pix= is specified then it is just copied through unchanged from the input file).  A further HDU named =badpix= is  written to the output file, which is a logical mask of the pixels that were zapped. Any additional HDUs in the input file are copied through unchanged. 

If the option =--debug= is specified then several extra image HDUs are saved to the output file.  It the case of the =edge= method these are: =scaled=, =edges=, =candidates=, and =labels=. 

In addition, a file =INPUT_FILE-objects.tab= is written with a table that lists the label number (corresponding to the =labels= image), sizes, and pruning criteria for all the candidate bad pixel objects. 

*** Examples
#+BEGIN_SRC sh
spotless  --data-range 0 10.0 --allow-shadows --output-id cr --verbose --debug F547M
#+END_SRC

