doc/spotless-intro.html
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Pruning the list of bad pixel objects</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
The pixel-rejection methods all tend to produce a large number of false positives.  Many of these can be effectively pruned with a few simple criteria.  Each candidate object is checked to make sure it is sufficiently small, sufficiently circular, and not a dark region.  The details of these checks can be controlled with the options <code>--dmax</code>, <code>--ddmax</code>, <code>--reject-filaments</code>, and <code>--allow-shadows</code>.  See the <a href="#sec-1-4">Command line reference</a> below for details. 
</p>
</div>
</div>


<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Manually excluding and including regions</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
The option <code>--exclude-regions-from-file FILENAME.reg</code> allows you to specify a DS9 region file for exclusion from the algorithm.  All regions in this file will be marked as "good".  That is, no cosmic ray detection will be performed inside the regions.  It is often necessary to use this option to protect known stars in your image (unless you want the stars to be zapped). 
</p>

<p>
Contrariwise, the option <code>--include-regions-from-file FILENAME.reg</code> allows you to specify known "bad" regions.  All regions in this file will be automatically added to the final list of bad pixel objects to be zapped.  
</p>
</div>
</div>

<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Which images are saved</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
By default, the <code>SCI</code> HDU in the output file has had all its final bad pixels zapped (but if the option <code>--only-bad-pix</code> is specified then it is just copied through unchanged from the input file).  A further HDU named <code>badpix</code> is  written to the output file, which is a logical mask of the pixels that were zapped. Any additional HDUs in the input file are copied through unchanged. 
</p>

<p>
If the option <code>--debug</code> is specified then several extra image HDUs are saved to the output file.  It the case of the <code>edge</code> method these are: <code>scaled</code>, <code>edges</code>, <code>candidates</code>, and <code>labels</code>. 
</p>

<p>
In addition, a file <code>INPUT_FILE-objects.tab</code> is written with a table that lists the label number (corresponding to the <code>labels</code> image), sizes, and pruning criteria for all the candidate bad pixel objects. 
</p>
</div>
</div>

<div id="outline-container-sec-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> Examples</h4>
<div class="outline-text-4" id="text-1-3-6">
<div class="org-src-container">

<pre class="src src-sh">spotless  --data-range 0 10.0 --allow-shadows --output-id cr --verbose --debug F547M
</pre>
</div>
</div>
</div>
</div>
