doc/spotless-intro.org
** Command line reference
:PROPERTIES:
:ID:       38945ACB-CA8C-4C73-9898-2EA1BF8272D1
:END:
#+BEGIN_SRC sh :exports both :results verbatim :dir ..
./spotless --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: spotless [-h] [--hdu-name HDU_NAME] [--output-id OUTPUT_ID]
                [--method {thresh,edge,segment}] [--onlybadpix]
                [--threshold THRESHOLD] [--dmax DMAX] [--ddmax DDMAX]
                [--data-range MIN MAX] [--use-log-scale]
                [--segment-pars LO HI]
                [--edge-pars SIGMA LOW_THRESHOLD HIGH_THRESHOLD]
                [--thick-edges] [--reject-filaments] [--allow-shadows]
                [--clip-negative]
                [--exclude-regions-from-file EXCLUDE_REGIONS_FROM_FILE]
                [--include-regions-from-file INCLUDE_REGIONS_FROM_FILE]
                [--verbose] [--debug] [--multi-hdu]
                fitsfile

Remove cosmic rays and other bad pixels from an image

positional arguments:
  fitsfile              Name of input image FITS file (sans extension)

optional arguments:
  -h, --help            show this help message and exit
  --hdu-name HDU_NAME   Which HDU to use from the FITS file (default: SCI)
  --output-id OUTPUT_ID
                        Extra string to add to output filename to
                        differentiate from the input file (default: cr)
  --method {thresh,edge,segment}
                        Algorithm to use to find the bad pixels (default:
                        edge)
  --onlybadpix          Only calculate the bad pixel map - do not replace
                        pixels in the image (default: False)
  --threshold THRESHOLD
                        Assume any pixel above this level is bad (default:
                        None)
  --dmax DMAX           Maximum diameter of features to zap. Leave alone any
                        roughly circular objects that are larger than this.
                        (default: 5)
  --ddmax DDMAX         Absolute maximum diameter of features to zap. Leave
                        alone any objects that are larger than this, whatever
                        their shape may be. (default: 10)
  --data-range MIN MAX  Range for data scaling (default: None)
  --use-log-scale       Use logarithmic data scaling (default: False)
  --segment-pars LO HI  For 'segment' method only: thresholds of scaled data
                        to seed the good/bad regions (default: (0.0, 1.0))
  --edge-pars SIGMA LOW_THRESHOLD HIGH_THRESHOLD
                        For 'edge' method only: parameters for the Canny edge
                        detection algorithm. See: http://scikits-
                        image.org/docs/dev/auto_examples/plot_canny.html
                        (default: (1.0, 0.1, 0.2))
  --thick-edges         Make the edges be 3 pixels wide instead of the default
                        1 (default: False)
  --reject-filaments    Try to reject objects that look filamentary, since
                        they are probably not cosmic rays (default: False)
  --allow-shadows       Also remove objects that are darker than their
                        surroudings (not generally advised, especially if you
                        have dark globules in your image!) (default: False)
  --clip-negative       Also remove all negative pixels (default: False)
  --exclude-regions-from-file EXCLUDE_REGIONS_FROM_FILE
                        Read DS9 regions from a file, which are to be marked
                        as definite good pixels (default: None)
  --include-regions-from-file INCLUDE_REGIONS_FROM_FILE
                        Read DS9 regions from a file, which are to be marked
                        as definite bad pixels (default: None)
  --verbose, -v         Print informative progress messages (default: False)
  --debug, -d           Save auxiliary images of intermediate steps (default:
                        False)
  --multi-hdu, -m       Only provided for backward compatibility - this
                        behavior is now the default. Work in multi-HDU mode.
                        This assumes that the image is in the "SCI" HDU in the
                        input file (the argument --hdu-index is ignored). All
                        additional HDUs in the input file are copied through
                        to the output file. Only one output file is written,
                        all auxilliary arrays ("edges", "labels", "badpix",
                        etc) are written as additional HDUs in the same file.
                        (default: True)
#+end_example

